evidence/qwen38-27b-v1.0/gx10-01-xxj/20260902-20260903/raw/benchmarks-raw/local-llm-cross-platform-benchmark/qwen38-27b-v1.0/gx10-single/formal-32k/fp8/formal100/formal100.log.txt
nohup: ignoring input
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xf699dd82bb00>, trust_remote_code=False, seed=20260831, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://<IP_REDACTED>:8000', host='<IP_REDACTED>', port=8000, endpoint='/v1/completions', header=None, max_concurrency=1, model='qwen38-27b-fp8-f5', input_len=32768, output_len=256, tokenizer='$HOME/xxj/models/original/qwen3.8-27b/fp8/017b9c7af6b5689d5dd426a76e0bc077eb5ca20a', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=1, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='$HOME/xxj/benchmarks/raw/local-llm-cross-platform-benchmark/qwen38-27b-v1.0/gx10-single/formal-32k/fp8/formal100', result_filename='formal100.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-b7ffc592-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-31 23:39:54 [utils.py:90] Sampling input_len from [32768, 32768] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 1 requests...

  0%|          | 0/1 [00:00<?, ?it/s]
100%|██████████| 1/1 [01:09<00:00, 69.13s/it]
100%|██████████| 1/1 [01:09<00:00, 69.13s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [01:09<1:54:43, 69.53s/it]
  2%|▏         | 2/100 [02:19<1:53:38, 69.58s/it]
  3%|▎         | 3/100 [03:29<1:52:43, 69.73s/it]
  4%|▍         | 4/100 [04:38<1:51:38, 69.78s/it]
  5%|▌         | 5/100 [05:47<1:49:39, 69.26s/it]
  6%|▌         | 6/100 [06:54<1:47:28, 68.60s/it]
  7%|▋         | 7/100 [08:01<1:45:40, 68.18s/it]
  8%|▊         | 8/100 [09:09<1:44:05, 67.88s/it]
  9%|▉         | 9/100 [10:16<1:42:38, 67.68s/it]
 10%|█         | 10/100 [11:23<1:41:20, 67.56s/it]
 11%|█         | 11/100 [12:31<1:40:07, 67.50s/it]
 12%|█▏        | 12/100 [13:38<1:38:55, 67.45s/it]
 13%|█▎        | 13/100 [14:45<1:37:50, 67.48s/it]
 14%|█▍        | 14/100 [15:53<1:36:40, 67.44s/it]
 15%|█▌        | 15/100 [17:00<1:35:28, 67.39s/it]
 16%|█▌        | 16/100 [18:07<1:34:18, 67.36s/it]
 17%|█▋        | 17/100 [19:15<1:33:10, 67.35s/it]
 18%|█▊        | 18/100 [20:23<1:32:20, 67.56s/it]
 19%|█▉        | 19/100 [21:30<1:31:09, 67.53s/it]
 20%|██        | 20/100 [22:38<1:29:58, 67.48s/it]
 21%|██        | 21/100 [23:45<1:28:50, 67.48s/it]
 22%|██▏       | 22/100 [24:52<1:27:43, 67.49s/it]
 23%|██▎       | 23/100 [26:00<1:26:36, 67.48s/it]
 24%|██▍       | 24/100 [27:07<1:25:26, 67.46s/it]
 25%|██▌       | 25/100 [28:15<1:24:20, 67.48s/it]
 26%|██▌       | 26/100 [29:22<1:23:14, 67.49s/it]
 27%|██▋       | 27/100 [30:30<1:22:04, 67.45s/it]
 28%|██▊       | 28/100 [31:37<1:20:55, 67.44s/it]
 29%|██▉       | 29/100 [32:45<1:19:46, 67.42s/it]
 30%|███       | 30/100 [33:52<1:18:39, 67.42s/it]
 31%|███       | 31/100 [34:59<1:17:32, 67.43s/it]
 32%|███▏      | 32/100 [36:07<1:16:27, 67.46s/it]
 33%|███▎      | 33/100 [37:14<1:15:18, 67.45s/it]
 34%|███▍      | 34/100 [38:22<1:14:10, 67.44s/it]
 35%|███▌      | 35/100 [39:29<1:13:04, 67.45s/it]
 36%|███▌      | 36/100 [40:37<1:11:56, 67.44s/it]
 37%|███▋      | 37/100 [41:44<1:10:48, 67.44s/it]
 38%|███▊      | 38/100 [42:51<1:09:39, 67.41s/it]
 39%|███▉      | 39/100 [43:59<1:08:32, 67.42s/it]
 40%|████      | 40/100 [45:06<1:07:25, 67.43s/it]
 41%|████      | 41/100 [46:14<1:06:18, 67.43s/it]
 42%|████▏     | 42/100 [47:21<1:05:11, 67.45s/it]
 43%|████▎     | 43/100 [48:29<1:04:04, 67.46s/it]
 44%|████▍     | 44/100 [49:36<1:02:57, 67.45s/it]
 45%|████▌     | 45/100 [50:44<1:01:52, 67.49s/it]
 46%|████▌     | 46/100 [51:51<1:00:48, 67.56s/it]
 47%|████▋     | 47/100 [53:00<59:48, 67.70s/it]  
 48%|████▊     | 48/100 [54:07<58:40, 67.71s/it]
 49%|████▉     | 49/100 [55:15<57:31, 67.67s/it]
 50%|█████     | 50/100 [56:23<56:24, 67.70s/it]
 51%|█████     | 51/100 [57:30<55:16, 67.69s/it]
 52%|█████▏    | 52/100 [58:38<54:08, 67.67s/it]
 53%|█████▎    | 53/100 [59:46<53:04, 67.75s/it]
 54%|█████▍    | 54/100 [1:00:53<51:55, 67.72s/it]
 55%|█████▌    | 55/100 [1:02:01<50:46, 67.70s/it]
 56%|█████▌    | 56/100 [1:03:09<49:38, 67.68s/it]
 57%|█████▋    | 57/100 [1:04:16<48:30, 67.69s/it]
 58%|█████▊    | 58/100 [1:05:24<47:21, 67.67s/it]
 59%|█████▉    | 59/100 [1:06:32<46:19, 67.80s/it]
 60%|██████    | 60/100 [1:07:40<45:07, 67.69s/it]
 61%|██████    | 61/100 [1:08:47<43:56, 67.60s/it]
 62%|██████▏   | 62/100 [1:09:54<42:46, 67.55s/it]
 63%|██████▎   | 63/100 [1:11:02<41:37, 67.51s/it]
 64%|██████▍   | 64/100 [1:12:09<40:28, 67.46s/it]
 65%|██████▌   | 65/100 [1:13:17<39:20, 67.44s/it]
 66%|██████▌   | 66/100 [1:14:24<38:11, 67.40s/it]
 67%|██████▋   | 67/100 [1:15:31<37:05, 67.43s/it]
 68%|██████▊   | 68/100 [1:16:39<35:57, 67.42s/it]
 69%|██████▉   | 69/100 [1:17:46<34:49, 67.41s/it]
 70%|███████   | 70/100 [1:18:54<33:42, 67.43s/it]
 71%|███████   | 71/100 [1:20:01<32:35, 67.43s/it]
 72%|███████▏  | 72/100 [1:21:08<31:27, 67.42s/it]
 73%|███████▎  | 73/100 [1:22:16<30:20, 67.41s/it]
 74%|███████▍  | 74/100 [1:23:23<29:12, 67.40s/it]
 75%|███████▌  | 75/100 [1:24:31<28:05, 67.41s/it]
 76%|███████▌  | 76/100 [1:25:38<26:57, 67.41s/it]
 77%|███████▋  | 77/100 [1:26:46<25:51, 67.44s/it]
 78%|███████▊  | 78/100 [1:27:53<24:43, 67.41s/it]
 79%|███████▉  | 79/100 [1:29:00<23:35, 67.39s/it]
 80%|████████  | 80/100 [1:30:08<22:27, 67.39s/it]
 81%|████████  | 81/100 [1:31:15<21:20, 67.39s/it]
 82%|████████▏ | 82/100 [1:32:23<20:13, 67.41s/it]
 83%|████████▎ | 83/100 [1:33:30<19:06, 67.42s/it]
 84%|████████▍ | 84/100 [1:34:37<17:58, 67.41s/it]
 85%|████████▌ | 85/100 [1:35:45<16:51, 67.41s/it]
 86%|████████▌ | 86/100 [1:36:52<15:44, 67.43s/it]
 87%|████████▋ | 87/100 [1:38:00<14:36, 67.41s/it]
 88%|████████▊ | 88/100 [1:39:07<13:28, 67.40s/it]
 89%|████████▉ | 89/100 [1:40:14<12:21, 67.40s/it]
 90%|█████████ | 90/100 [1:41:22<11:13, 67.40s/it]
 91%|█████████ | 91/100 [1:42:29<10:06, 67.41s/it]
 92%|█████████▏| 92/100 [1:43:37<08:59, 67.39s/it]
 93%|█████████▎| 93/100 [1:44:44<07:51, 67.40s/it]
 94%|█████████▍| 94/100 [1:45:51<06:44, 67.41s/it]
 95%|█████████▌| 95/100 [1:46:59<05:37, 67.42s/it]
 96%|█████████▌| 96/100 [1:48:06<04:29, 67.39s/it]
 97%|█████████▋| 97/100 [1:49:14<03:22, 67.42s/it]
 98%|█████████▊| 98/100 [1:50:21<02:14, 67.44s/it]
 99%|█████████▉| 99/100 [1:51:30<01:07, 67.89s/it]
100%|██████████| 100/100 [1:52:38<00:00, 67.82s/it]
100%|██████████| 100/100 [1:52:38<00:00, 67.58s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  6758.26   
Total input tokens:                      3276800   
Total generated tokens:                  25600     
Request throughput (req/s):              0.01      
Output token throughput (tok/s):         3.79      
Peak output token throughput (tok/s):    7.00      
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          488.65    
---------------Time to First Token----------------
Mean TTFT (ms):                          27602.71  
Median TTFT (ms):                        27538.72  
P50 TTFT (ms):                           27538.72  
P90 TTFT (ms):                           27805.27  
P95 TTFT (ms):                           28230.17  
P99 TTFT (ms):                           28516.32  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          156.78    
Median TPOT (ms):                        156.44    
P50 TPOT (ms):                           156.44    
P90 TPOT (ms):                           157.34    
P95 TPOT (ms):                           158.88    
P99 TPOT (ms):                           161.75    
---------------Inter-token Latency----------------
Mean ITL (ms):                           156.78    
Median ITL (ms):                         157.16    
P50 ITL (ms):                            157.16    
P90 ITL (ms):                            159.73    
P95 ITL (ms):                            161.62    
P99 ITL (ms):                            163.68    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          67582.36  
Median E2EL (ms):                        67435.00  
P50 E2EL (ms):                           67435.00  
P90 E2EL (ms):                           67766.37  
P95 E2EL (ms):                           68357.72  
P99 E2EL (ms):                           69858.37  
==================================================